/*
MySQL Data Transfer
Source Host: localhost
Source Database: elf
Target Host: localhost
Target Database: elf
Date: 2010-7-26 AM 10:57:52
*/

SET FOREIGN_KEY_CHECKS=0;
-- ----------------------------
-- Table structure for announcement
-- ----------------------------
CREATE TABLE `announcement` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `type` varchar(20) NOT NULL DEFAULT '',
  `title` varchar(100) NOT NULL,
  `content` varchar(10000) NOT NULL,
  `createtime` datetime NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records 
-- ----------------------------
INSERT INTO `announcement` VALUES ('1', 'INDEX', 'E路发七月三大活动倾情奉献', '一：首存红利 高达68%，最高680元，提款30分钟到账！\r<br/>\r<br/>二：高额返水 最低0.3%的返水，多投多送，最高可达1%！\r<br/>\r<br/>三：幸运红包 每周四随机抽取幸运玩家260名，最高奖金8888元！\r<br/>\r<br/>\r<br/>\r<br/>    详情请参考首页的“最新优惠”或与客服联系。', '2010-07-26 10:50:00');
INSERT INTO `announcement` VALUES ('2', 'INDEX', '最新优惠', '七月幸运大抽奖规则与条件：\r<br/>\r<br/>一、凡E路发开通用户均可参加本月幸运大抽奖活动。\r<br/>\r<br/>二、幸运大抽奖的统计时段为上周四的0点至本周四的0点。系统自动抽取时段为每周四12:00-18:00点，会员中奖信息与中奖金额将在18:00后公布，并自动添加奖金至中奖会员账并公布本周幸运中奖名单。\r<br/>\r<br/>三、奖金将会直接派发到会员E路发账号，同时电话通知。\r<br/>\r<br/>四、无任何限制，可直接申请提款。\r<br/>\r<br/>五、e68.ph拥有最终解释权。\r<br/>\r<br/>点击查看 7.22第39期中奖名单\r<br/>\r<br/>七月首存反赠68%，高达￥680!规则与条件:\r<br/>\r<br/>一、首次存款即可申请能获得68%首存红利，最多可达RMB 680。 \r<br/>\r<br/>二、活动时间2010年7月1号到7月31号,首次存款不得低于RMB 100,需在首存后第一笔投注之前向客服申请。\r<br/>\r<br/>三、新会员必须用本金加68%红利下注，其有效投注额达其至少30倍后，才能提取红利。\r<br/>\r<br/>四、68%首存红利申请，需联系我们网站上的在线客服申请，电话核实会员本人确认后，30分钟内红利将自动存入会员户口。\r<br/>\r<br/>五、会员在申请反赠得其红利后，投注额在未达30倍之前，余额超本金的1.68倍下，如果会员需要提款，则只能提取本金。\r<br/>\r<br/>六、用户涉及个人或团体以不正当的手法如下述，进行套取相关优惠奖金，本网站有权在不通知的情况下冻结或关闭相关账户，并扣除其所得红利及盈利，.\r<br/>\r<br/>a、用户拥有超过一个账户，包括同一姓名、同一邮件地址、同一IP地址（连接式如192.168.167.33，192.168.167.34，192.168.168.01同样被判定为相同IP）、同一住址、同一借记卡/信用卡、同一银行账户、同一电脑（大学，团体，网吧，图书馆，办公室等），被视为联合账户或可疑账户。\r<br/>\r<br/>b、无风险投注，对投注行为。 \r<br/>\r<br/>有效投注额：在百家乐中，有出和的情况，当投注庄或者投注闲，出和局，赌场会退还下注本金，这部分投注记为无效投注。在轮盘和骰宝中，出现红与黑，单与双，大与小等只有两种选择的投注项目而同时压注的情况，记为无效投注。 \r<br/>\r<br/>\r<br/>七、e68.ph拥有最终解释权利。 \r<br/>\r<br/>\r<br/>\r<br/>\r<br/>\r<br/>七月多重洗码大赠送活动时间2010年7月1号到7月31号。\r<br/>\r<br/>洗码优惠活动是从每周一的中午12：00到下周一的11：59为一周期进行统计，统计时间为每周一的中午13：00至20：00结算，预计会在20:30-23：59分添加完毕,结算完毕后会及时的添加到获得返利的会员账号中，并电话通知。 \r<br/>\r<br/>\r<br/>\r<br/>1、一周内有效投注额为50万以内的会员，可享受0.3%的洗码优惠。\r<br/>\r<br/>2、一周内洗码量为50万-100万的会员，可享受0.4%的洗码优惠。\r<br/>\r<br/>3、一周内洗码量为100万-300万的会员，可享受0.6%的洗码优惠。\r<br/>\r<br/>4、一周内洗码量为300万-500万的会员，可享受0.8%的洗码优惠。\r<br/>\r<br/>5、一周内洗码量达到500万或以上的会员，可享受1%的洗码优惠（周最高五万）。\r<br/>\r<br/>如会员出现出现对赌等不正当投注，取消该活动参与资格。\r<br/>\r<br/>\r<br/>\r<br/>\r<br/>备注：以上优惠均可同时享受。 ', '2010-07-26 10:50:34');
INSERT INTO `announcement` VALUES ('3', 'INDEX', '2010七月幸运大抽奖【第三十九期】获奖会员名单', '规则与条件：\r<br/>\r<br/>一、凡E路发开通用户均可参加本月幸运大抽奖活动。\r<br/>\r<br/>二、幸运大抽奖的统计时段为上周四的0点至本周四的0点。系统自动抽取时段为每周四12:00-18:00点，会员中奖信息与中奖金额将在18:00后公布，并自动添加奖金至中奖会员账并公布本周幸运中奖名单\r<br/>\r<br/>三、奖金将会直接派发到会员E路发账号，同时电话通知。\r<br/>\r<br/>四、无任何限制，可直接申请提款。\r<br/>\r<br/>五、e68.ph拥有最终解释权。\r<br/>\r<br/>开门见喜，好运常来！\r<br/>\r<br/>E路发7.22幸运大抽奖第39期幸运中奖玩家名单如下：\r<br/>\r<br/>超级幸运奖 8888元 1名\r<br/>\r<br/>hui***\r<br/>\r<br/>福星大奖 6888元 2名\r<br/>\r<br/>hun***、san***\r<br/>\r<br/>财神大奖 3888元 3名 \r<br/>\r<br/>778***、936***、zou***\r<br/>\r<br/>喜气洋洋 1888元 6名\r<br/>\r<br/>xia***、qit***、nvg***、zen***、mlo***、wpl***\r<br/>\r<br/>大吉大利 888 元 8名\r<br/>\r<br/>ssy***、hua***、a17***、nba***、yvy***、ysw***、 li1***、cha*** \r<br/>\r<br/>大富大贵 388 元 10名 \r<br/>\r<br/>xia***、dai***、ypf***、emm***、dan***、yun***、ans***、 wei***、gai***、385*** \r<br/>\r<br/>一路长红 188 元 50 名\r<br/>\r<br/>cn1***、136***、lv.***、lpj***、cjl***、xm1***、L41***、 lin***、rqs***、254***、vvv***、e68***、pre***、300*** 、odk***、tin***、mes***、liu***、446***、dur***、shi***、 hui***、gao***、wen***、sin***、abc***、akv***、quj***、100***、chn***、koe***、sj8***、hwa***、qin***、mai***、lpq***、ju3***、lqp***、vye***、mff***、el2***、lai***、cjg***、002***、tan***、wpq***、qwl***、vjg***、487***、229*** \r<br/>\r<br/>好运常来 88 元 80 名\r<br/>\r<br/>hbw***、149***、lrg***、zht***、ll8***、lao***、lin***、 yao***、cyj***、jin***、ngl***、mar***、dea***、liu***、 xio***、suk***、kis***、lc7***、lxy***、CHE***、lzh***、 lsw***、zho***、dp8***、lih***、q15***、zer***、tth***、 top***、zun***、xmv***、cui*** 、wej***、363***、lfg***、 hxq***、w25***、chx***、wyp***、138***、dia***、WAN***、 kou***、nnk***、aao***、sok***、tai***、jiu***、quk***、 mvl**、spw***、397***、lqp***、n47***、sse***、lrt***、 jun***、eit***、and***、sun***、hye***、low***、lgh***、 lai***、bak***、mri***、lan***、335***、jru***、396***、 tue***、whi***、rek***、hhd***、nkg***、bcg***、mkg***、 dau***、alg***、eug*** \r<br/>\r<br/>恭喜发财 38元 100名\r<br/>\r<br/>jan***、jhy***、qq1***、ciy***、e68***、aaa***、pul***、 wo8***、son***、xjl***、yuh***、yu1***、WAN***、278***、 ton***、anh***、cxx***、daj***、lai***、yj8***、yz1***、 ljb***、zwj***、hr1***、lin***、bin***、lin***、yuf***、 hom***、136***、ylp***、553***、zhz***、zhi***、zha***、 smi***、hfx***、wan***、hym***、nbn***、xb5***、son***、 lvt***、zrz***、ric***、yin***、ctt***、sho***、abc***、 hdm***、tqg***、sz1***、e68***、kk3***、sy8***、wwc***、 zxc***、zzy***、jin***、she***、nin***、shi***、vv7***、 yxr***、men***、ouy***、trp***、she***、shj***、bru***、 hh3***、dcd***、gan***、yoy***、yy8***、xbz***、bob***、 clj***、eri***、xfs***、631***、zu5***、xia***、sun***、 h33***、904***、281***、sup***、zhe***、e8a***、fan***、 aoo***、gua***、tyt***、lil***、jay***、YCL***、cqx***、 dc4***、135*** \r<br/>\r<br/>恭喜中奖玩家！一份好运送给您！\r<br/>\r<br/>奖金已发送至E路发账户，可直接申请提款。\r<br/>', '2010-07-26 10:55:52');
